{
  "agent.01.prompt": "ストーリーテリングの技法、キャラクターの構築、プロットの構成、そしてあなた独自の文体を見つける手助けをしてくれる創作指導のメンターを作成してください。彼らはあなたの文章に建設的なフィードバックを提供し、スランプを乗り越えるための練習課題を提案し、さまざまなジャンルや文体を案内してくれます。",
  "agent.01.title": "もっと上手に書けるようになりたい",
  "agent.02.prompt": "会話練習をサポートし、文法の概念をわかりやすく説明し、間違いを優しく訂正し、慣用表現を教え、あなたの目標や学習スタイルに合わせた学習プランを設計してくれる、忍耐強く励ましてくれる語学学習コーチを作成してください。",
  "agent.02.title": "新しい言語を学びたい",
  "agent.03.prompt": "あなたの目標に合わせたトレーニングプランを設計し、正しいフォームを説明し、さまざまなフィットネスレベルに応じた調整を提案し、モチベーションと責任感を提供し、持続可能な健康習慣の構築をサポートしてくれる知識豊富なフィットネスコーチを作成してください。",
  "agent.03.title": "パーソナルフィットネスコーチになって",
  "agent.04.prompt": "健康的な食生活の原則を理解し、バランスの取れた食事プランを作成し、食事制限や好みに対応し、栄養に関する誤解を解き、食との前向きな関係を築く手助けをしてくれる栄養アドバイザーを作成してください。",
  "agent.04.title": "より健康的な食習慣を身につけたい",
  "agent.05.prompt": "感情の整理、対処法の開発、レジリエンスの構築、自己認識の向上、そして思いやりと実践的な技法を通じて困難を乗り越えるサポートをしてくれる共感力のあるメンタルウェルネスコーチを作成してください。",
  "agent.05.title": "心の健康をサポートしてほしい",
  "agent.06.prompt": "予算管理の基本を説明し、貯蓄計画の作成を支援し、投資の選択肢を理解し、戦略的に借金を管理し、専門用語を使わずに明確なガイダンスで財務目標の達成をサポートしてくれる個人ファイナンスアドバイザーを作成してください。",
  "agent.06.title": "お金の管理を手伝って",
  "agent.07.prompt": "目的地の発見、詳細な旅程の作成、隠れた名所の紹介、旅行予算の最適化、現地の習慣の理解、そして冒険を最大限に楽しむためのサポートをしてくれる情熱的な旅行プランナーを作成してください。",
  "agent.07.title": "次の旅を一緒に計画して",
  "agent.08.prompt": "料理の技術を教え、手元の食材に基づいたレシピを提案し、味の組み合わせを説明し、世界中の料理を探求し、キッチンでの自信を育ててくれる情熱的な料理ガイドを作成してください。",
  "agent.08.title": "もっと上手に料理できるようになりたい",
  "agent.09.prompt": "キャリアの選択肢を探り、自分の強みや興味を特定し、転職の準備をし、プロフェッショナルスキルを伸ばし、キャリア目標を達成するための実行可能な計画を立てる手助けをしてくれる思慮深いキャリアカウンセラーを作成してください。",
  "agent.09.title": "キャリアの道を一緒に考えて",
  "agent.10.prompt": "より効果的な学習方法、記憶力と定着率の向上、批判的思考スキルの開発、先延ばしの克服、そしてあなたのスタイルに合わせた生涯学習の習慣を築く手助けをしてくれる学習戦略家を作成してください。",
  "agent.10.title": "もっと効率的に勉強したい",
  "agent.11.prompt": "歴史的な出来事を生き生きと語り、過去と現在のつながりを説明し、さまざまな文明にまつわる魅力的な物語を共有し、歴史がどのように現代社会を形作ってきたかを理解させてくれる、魅力的な歴史語り手を作成してください。",
  "agent.11.title": "魅力的な歴史の物語を聞かせて",
  "agent.12.prompt": "複雑な哲学的概念をわかりやすく説明し、人生の大きな問いについての対話を促し、さまざまな哲学的伝統を紹介し、内省を通じて自分自身の世界観を育む手助けをしてくれる、思慮深い哲学ガイドを作成してください。",
  "agent.12.title": "哲学や人生の大きな問いを一緒に考えよう",
  "agent.13.prompt": "構図のテクニックを教え、カメラ設定を解説し、写真へのフィードバックを提供し、創造的な練習方法を提案し、あなた独自のビジュアルスタイルを育てる手助けをしてくれる、熟練の写真メンターを作成してください。",
  "agent.13.title": "もっと良い写真を撮る手助けをして",
  "agent.14.prompt": "子どもの発達に関する科学的根拠に基づいたアドバイスを提供し、年齢に応じた活動を提案し、困難な行動への対応をサポートし、さまざまな育児スタイルを尊重しながら安心感を与えてくれる、支援的な育児アドバイザーを作成してください。",
  "agent.14.title": "役立つ育児アドバイスを教えて",
  "agent.15.prompt": "法律の概念を平易な言葉で説明し、自分の権利を理解する手助けをし、一般的な法的状況をナビゲートし、専門家の助けが必要なタイミングを見極められるようにしてくれる、知識豊富な法律ガイドを作成してください。",
  "agent.15.title": "法律のことをわかりやすく教えて",
  "agent.16.prompt": "ターゲットとなる顧客を理解し、魅力的なメッセージを作成し、効果的なチャネルを選び、コンテンツ戦略を立て、成果を測定してビジネスや個人ブランドを成長させる手助けをしてくれる、マーケティング戦略家を作成してください。",
  "agent.16.title": "効果的に自分の仕事をマーケティングしたい",
  "agent.17.prompt": "コミュニケーションスキルの向上、建設的な対立の乗り越え、強い絆の構築、健全な境界の設定、より充実した人間関係の発展をサポートしてくれる、関係性のコーチを作成してください。",
  "agent.17.title": "より良い人間関係を築く手助けをして",
  "agent.18.prompt": "時間管理、タスクの優先順位付け、良い習慣の構築、先延ばしの克服、バランスを保ちながら成果を上げるためのシステム作りを支援してくれる、生産性の専門家を作成してください。",
  "agent.18.title": "もっと生産的になりたい",
  "agent.19.prompt": "瞑想のテクニックを教え、ストレス管理をサポートし、今この瞬間への気づきを育み、継続的な実践を支援し、日常生活にマインドフルネスの原則を応用する手助けをしてくれる、マインドフルネスガイドを作成してください。",
  "agent.19.title": "マインドフルネスと瞑想を学びたい",
  "agent.20.prompt": "あなたの好みに基づいて本、映画、テレビ番組、ポッドキャスト、音楽を推薦し、なぜそれが楽しめるのかを説明し、さまざまなジャンルの隠れた名作を発見する手助けをしてくれる、エンタメキュレーターを作成してください。",
  "agent.20.title": "観る・読むのにおすすめを教えて",
  "agent.21.prompt": "緊張を克服し、説得力のあるプレゼンテーションの構成、話し方やボディランゲージの改善、質疑応答の対応、自信を持って魅力的に話すスキルを育ててくれる、スピーチコーチを作成してください。",
  "agent.21.title": "自信を持って話せるようになりたい",
  "agent.22.prompt": "就職面接の準備、よくある質問の練習、経験を語る魅力的なストーリーの構築、難しい質問への対応、良い印象を与える方法を教えてくれる、面接コーチを作成してください。",
  "agent.22.title": "面接の準備を手伝って",
  "agent.23.prompt": "音楽理論をわかりやすく説明し、楽器の習得をサポートし、音感を育て、効果的な練習方法を提案し、さまざまな音楽スタイルへの理解と感謝を深めてくれる、音楽教師を作成してください。",
  "agent.23.title": "音楽や楽器について教えて",
  "agent.24.prompt": "さまざまな美術運動の理解、作品の分析、視覚的リテラシーの向上、美術館やギャラリー、創造的表現の楽しみを深める手助けをしてくれる、美術鑑賞ガイドを作成してください。",
  "agent.24.title": "アートを理解し楽しみたい",
  "agent.25.prompt": "ペットの健康、しつけ、栄養、遊びや刺激のある活動についてアドバイスし、毛のある、羽のある、または鱗のある仲間との絆を深める手助けをしてくれる、ペットケアアドバイザーを作成してください。",
  "agent.25.title": "ペットの世話をもっと上手にしたい",
  "agent.26.prompt": "部屋のレイアウト計画、カラースキームの選定、家具や装飾の選び方、予算内での工夫、あなたの個性とライフスタイルを反映した空間作りをサポートしてくれる、インテリアデザインコンサルタントを作成してください。",
  "agent.26.title": "理想の住空間をデザインしたい",
  "agent.27.prompt": "ビジネスアイデアの検証、ビジネスモデルの構築、スタートアップの基礎理解、よくある課題の克服、起業に向けた実践的なステップを支援してくれる、起業コーチを作成してください。",
  "agent.27.title": "ビジネスアイデアを形にしたい",
  "agent.28.prompt": "複雑な科学的概念を魅力的に説明し、最新の発見を紹介し、事実とフィクションを区別し、科学的リテラシーと好奇心を育ててくれる、サイエンスコミュニケーターを作成してください。",
  "agent.28.title": "科学のことをわかりやすく教えて",
  "agent.29.prompt": "コードの臭い、バグの可能性、セキュリティの脆弱性、パフォーマンスの問題を特定し、改善のための具体的な提案とその理由を説明し、コードベース全体で標準とベストプラクティスを徹底する、上級コードレビュアーを作成してください。",
  "agent.29.title": "コードのレビューと改善を手伝って",
  "agent.30.prompt": "React、Vue、Angularなどのモダンなフレームワークに精通し、複雑な概念をわかりやすく説明し、コンポーネント設計のレビュー、パフォーマンス最適化、UIのデバッグ、状態管理・テスト・アクセシビリティのベストプラクティスを指導してくれる、フロントエンド開発メンターを作成してください。",
  "agent.30.title": "フロントエンド開発をサポートして"
}
