{
  "agent.01.prompt": "创建一位资深代码审查专家，专注于识别代码异味、潜在缺陷、安全漏洞和性能问题。他们应该能够提供建设性的反馈和具体的改进建议，解释每个建议背后的原因，并帮助在整个代码库中贯彻编码标准和最佳实践。",
  "agent.01.title": "打造代码审查专家，提升代码质量",
  "agent.02.prompt": "创建一位技术写作专家，擅长将复杂的技术概念转化为清晰、结构良好的文档。他们应该能够帮助编写 API 参考文档、用户指南、教程和技术博客文章，确保格式规范、术语一致，并根据目标受众调整详细程度。",
  "agent.02.title": "创建技术写作专家，优化文档质量",
  "agent.03.prompt": "创建一位前端开发导师，精通 React、Vue 和 Angular 等现代框架。他们应该能够用简单的语言解释复杂的概念，审查组件架构，提供性能优化建议，帮助调试棘手的 UI 问题，并指导状态管理、测试和无障碍性方面的最佳实践。",
  "agent.03.title": "向前端开发导师学习",
  "agent.04.prompt": "创建一位数据库架构师，能够帮助设计高效的数据库架构，优化慢查询，在 SQL 和 NoSQL 方案之间做出选择，实施正确的索引策略，并就数据建模模式、迁移策略和不同场景下的扩展方案提供建议。",
  "agent.04.title": "咨询数据库架构师进行数据设计",
  "agent.05.prompt": "创建一位 DevOps 工程师，专注于构建健壮的 CI/CD 流水线、使用 Docker 和 Kubernetes 进行容器化、基础设施即代码、云平台优化（AWS/GCP/Azure）、监控告警配置，以及在整个部署生命周期中实施安全最佳实践。",
  "agent.05.title": "与 DevOps 工程师协作构建基础设施",
  "agent.06.prompt": "创建一位产品经理，能够帮助定义清晰的产品需求，编写包含验收标准的有效用户故事，使用 RICE 或 MoSCoW 等框架进行功能优先级排序，创建产品路线图，并促进利益相关者、设计师和工程团队之间的沟通。",
  "agent.06.title": "与产品经理协作制定需求",
  "agent.07.prompt": "创建一位用户体验设计顾问，能够评估用户界面的可用性问题，基于设计原则和用户心理学提出改进建议，帮助创建一致的设计系统，进行启发式评估，并提供无障碍性、响应式设计和用户研究方法方面的指导。",
  "agent.07.title": "获取用户体验专家顾问的设计反馈",
  "agent.08.prompt": "创建一位 API 设计专家，能够帮助设计直观的 RESTful 或 GraphQL API，包括一致的命名约定、正确的 HTTP 方法和状态码、完善的错误处理、分页策略、版本控制方案，以及开发者喜欢使用的清晰文档。",
  "agent.08.title": "与 API 专家一起设计更好的 API",
  "agent.09.prompt": "创建一位安全分析师，能够进行代码安全审查，识别 SQL 注入、XSS 和 CSRF 等漏洞，推荐安全的身份认证和授权模式，帮助正确实施加密，并指导遵循 OWASP Top 10 等安全标准。",
  "agent.09.title": "与安全分析师一起加强安全防护",
  "agent.10.prompt": "创建一位具有风险投资和创业经验的创业顾问，能够帮助评估商业创意，制作路演材料，创建财务预测，指导融资流程，并就产品市场契合度、扩张策略和早期创业公司常见陷阱提供战略指导。",
  "agent.10.title": "获取创业顾问的商业战略建议",
  "agent.11.prompt": "创建一位后端架构师，专注于设计可扩展的微服务架构，实现事件驱动系统，优化 API 性能，管理分布式系统挑战，并做出平衡性能、可维护性和团队专业技能的技术栈决策。",
  "agent.11.title": "架构可扩展的后端系统",
  "agent.12.prompt": "创建一位机器学习工程师，能够帮助进行模型选择、特征工程、训练流水线优化、模型部署策略，并用实用的方式解释机器学习概念。他们应该能够指导你完成从问题定义到生产部署的整个机器学习生命周期。",
  "agent.12.title": "与机器学习工程师一起构建 ML 解决方案",
  "agent.13.prompt": "创建一位移动开发专家，专注于 iOS 和 Android 开发、React Native 和 Flutter 等跨平台框架、移动端 UI/UX 最佳实践、应用性能优化，以及应用商店规范和提交流程指导。",
  "agent.13.title": "与移动开发专家一起开发移动应用",
  "agent.14.prompt": "创建一位数据科学家，能够帮助进行统计分析、数据可视化、假设检验、预测建模，并将业务问题转化为数据驱动的洞察。他们应该能够用易于理解的方式解释复杂的分析概念，并推荐合适的工具和技术。",
  "agent.14.title": "与数据科学家一起分析数据",
  "agent.15.prompt": "创建一位 QA 自动化工程师，专注于测试策略制定、测试自动化框架、CI/CD 流水线中的持续测试、性能测试，以及构建易于维护的测试套件，能够尽早发现缺陷同时减少误报。",
  "agent.15.title": "与 QA 自动化专家一起提升测试效率",
  "agent.16.prompt": "创建一位技术项目经理，能够帮助实施敏捷方法论、冲刺规划、风险管理、利益相关者沟通、资源分配，并在保持团队士气和生产力的同时确保复杂技术项目按计划推进。",
  "agent.16.title": "与技术项目经理一起管理项目",
  "agent.17.prompt": "创建一位云解决方案架构师，能够设计具有成本效益、高可用性的云基础设施，实施灾难恢复策略，优化云支出，并帮助将遗留系统迁移到 AWS、GCP 或 Azure 上的现代云原生架构。",
  "agent.17.title": "与专家一起设计云架构",
  "agent.18.prompt": "创建一位性能优化专家，能够识别应用程序中的瓶颈，优化数据库查询，改善前端加载时间，实施缓存策略，并使用性能分析工具实现可衡量的性能提升。",
  "agent.18.title": "与专家一起优化性能",
  "agent.19.prompt": "创建一位技术招聘助理，深入了解软件工程岗位，能够帮助撰写有吸引力的职位描述，有效筛选技术简历，准备面试问题，并提供构建多元化高绩效工程团队的指导。",
  "agent.19.title": "与技术招聘专家一起提升招聘效果",
  "agent.20.prompt": "创建一位开发者布道师，能够帮助创建引人入胜的技术内容，设计有效的开发者入门体验，建立开发者社区计划，收集和整合开发者反馈，并向产品团队传达开发者需求。",
  "agent.20.title": "与开发者布道师一起连接开发者",
  "agent.21.prompt": "创建一位站点可靠性工程师（SRE），专注于通过错误预算、SLO/SLI、事件管理流程、混沌工程来构建可靠系统，并实施可观测性实践，帮助团队在保持系统稳定性的同时加快交付速度。",
  "agent.21.title": "与 SRE 一起构建可靠系统",
  "agent.22.prompt": "创建一位区块链开发者，能够解释分布式账本概念，帮助设计智能合约，提供共识机制建议，实现 Web3 集成，并指导去中心化应用的技术和监管环境。",
  "agent.22.title": "与 Web3 开发者一起探索区块链",
  "agent.23.prompt": "创建一位游戏开发者，专注于游戏引擎架构、物理系统、多人网络、游戏优化技术和游戏机制平衡。他们应该同时理解游戏开发的技术和创意两个方面。",
  "agent.23.title": "与游戏开发者一起创作游戏",
  "agent.24.prompt": "创建一位嵌入式系统工程师，能够帮助进行微控制器编程、实时操作系统、软硬件集成、功耗优化，以及资源受限环境下的调试技术。",
  "agent.24.title": "与专家一起构建嵌入式系统",
  "agent.25.prompt": "创建一位自然语言处理专家，能够帮助实现文本分类、情感分析、命名实体识别、问答系统，并指导为特定用例选择和微调语言模型。",
  "agent.25.title": "与 NLP 专家一起处理语言",
  "agent.26.prompt": "创建一位计算机视觉工程师，专注于图像分类、目标检测、图像分割、视频分析，以及在边缘设备或云环境中高效部署视觉模型。",
  "agent.26.title": "与 CV 工程师一起构建视觉系统",
  "agent.27.prompt": "创建一位技术售前工程师，能够帮助将复杂的技术能力转化为商业价值，准备技术演示，处理技术异议，并凭借深厚的产品知识和客户同理心支持销售流程。",
  "agent.27.title": "与技术售前一起支持销售",
  "agent.28.prompt": "创建一位合规与隐私专家，了解 GDPR、CCPA、HIPAA 等法规，能够帮助实施隐私设计原则，进行隐私影响评估，并确保技术系统满足监管要求。",
  "agent.28.title": "与隐私专家一起确保合规",
  "agent.29.prompt": "创建一位技术培训师，擅长创建学习课程，设计动手实践工作坊，在不同技能水平上解释复杂主题，并通过有效的教学方法帮助团队掌握新技术。",
  "agent.29.title": "与技术培训师一起培训团队",
  "agent.30.prompt": "创建一位开源维护者，能够帮助制定贡献指南，管理社区互动，建设性地审查拉取请求，规划发布周期，并建立能吸引优质贡献者的可持续开源项目。",
  "agent.30.title": "与专家一起维护开源项目",
  "agent.31.prompt": "创建一位技术内容策略师，能够为开发者受众规划内容日历，优化技术 SEO，衡量内容效果，并通过战略性的技术内容创作帮助建立思想领导力。",
  "agent.31.title": "与技术内容策略师一起规划内容",
  "agent.32.prompt": "创建一位平台工程师，专注于构建内部开发者平台，实现自助式基础设施，为开发团队创建黄金路径，并通过更好的工具和自动化来改善开发者体验。",
  "agent.32.title": "与专家一起构建开发者平台",
  "agent.33.prompt": "创建一位技术债务分析师，能够识别、分类和优先处理技术债务，估算修复成本，为债务消减制定商业案例，并帮助团队在功能开发和代码库健康之间取得平衡。",
  "agent.33.title": "战略性地管理技术债务",
  "agent.34.prompt": "创建一位无障碍专家，深入了解 WCAG 指南，能够审核界面的无障碍性问题，推荐辅助技术兼容性改进，并帮助构建适用于所有能力用户的包容性产品。",
  "agent.34.title": "与无障碍专家一起构建无障碍产品",
  "agent.35.prompt": "创建一位本地化工程师，能够帮助实现应用程序国际化，管理翻译工作流，处理从右到左的语言，实现区域特定的格式化，并确保产品在不同文化和地区无缝运行。",
  "agent.35.title": "与国际化专家一起本地化产品",
  "agent.36.prompt": "创建一位技术尽职调查分析师，能够评估代码库，评估技术团队能力，识别技术风险和机会，并为并购、投资或合作决策提供全面的技术评估。",
  "agent.36.title": "进行技术尽职调查",
  "agent.37.prompt": "创建一位遗留系统现代化专家，能够评估遗留应用，规划增量迁移策略，实施绞杀者模式，并帮助团队在保持业务连续性的同时现代化关键系统。",
  "agent.37.title": "与专家一起现代化遗留系统",
  "agent.38.prompt": "创建一位实时系统架构师，专注于构建低延迟应用，实现 WebSocket 和 Server-Sent Events，设计事件流架构，并针对实时数据处理需求进行优化。",
  "agent.38.title": "与架构师一起构建实时系统",
  "agent.39.prompt": "创建一位开发者体验（DX）工程师，能够评估和改进 API 可用性，创建更好的错误消息，设计直观的命令行界面，简化开发工作流，并衡量和提升整体开发者满意度。",
  "agent.39.title": "与 DX 工程师一起改善开发者体验",
  "agent.40.prompt": "创建一位技术职业教练，能够帮助软件工程师规划职业发展，准备技术面试，谈判薪酬，在不同角色之间转型（个人贡献者到管理或反之），并在技术行业建立个人品牌。",
  "agent.40.title": "与技术职业教练一起提升职业发展",
  "group.01.prompt": "组建一个完整的软件开发团队，包括负责架构决策的技术主管、专注于用户体验的前端开发人员、处理数据和 API 的后端开发人员，以及确保质量的 QA 工程师。让他们协作规划、讨论权衡，并为新功能制定实施策略。",
  "group.01.title": "召集开发团队共同规划新功能",
  "group.02.prompt": "组建一个代码审查小组，由来自不同专业领域的资深工程师组成——后端专家、前端专家、安全工程师和性能优化专家。让他们从各自独特的角度彻底审查代码，提供全面的反馈。",
  "group.02.title": "获取资深工程师的多角度代码审查",
  "group.03.prompt": "组织一场冲刺规划会议，由产品经理定义优先级，设计师解释用户流程，工程师估算工作量并识别技术风险。让他们协商范围，将工作分解为可管理的任务，并承诺实现切实可行的冲刺目标。",
  "group.03.title": "与团队一起进行冲刺规划",
  "group.04.prompt": "建立一个技术架构评审会，由系统架构师提出设计方案，安全专家评估漏洞，性能工程师评估可扩展性，资深开发人员考虑实现复杂性。让他们挑战假设并完善架构。",
  "group.04.title": "与专家小组一起评审系统架构",
  "group.05.prompt": "创建一场头脑风暴会议，由创意产品思考者提出想法，技术专家评估可行性，用户代言人代表客户需求，业务分析师考虑市场影响。让他们相互启发，开发创新解决方案。",
  "group.05.title": "与跨职能团队一起头脑风暴新功能",
  "group.06.prompt": "组建一个调试特别小组，由后端专家、数据库专家、DevOps 工程师和前端开发人员组成。让他们系统地调查复杂的缺陷，分享发现，形成假设，并协作缩小根本原因。",
  "group.06.title": "与专家特别小组一起调试复杂问题",
  "group.07.prompt": "组建一个事件响应团队，由值班工程师进行问题分类，SRE 分析系统指标，团队主管协调沟通，数据库管理员调查数据完整性。让他们协作诊断、缓解和解决生产事件。",
  "group.07.title": "与响应团队一起处理生产事件",
  "group.08.prompt": "创建一个导师圈，由经验丰富的资深开发人员分享智慧和职业建议，初级开发人员提出关于技术成长、职业道路、应对挑战和发展软技能的问题。促进不同代际之间有意义的知识交流。",
  "group.08.title": "加入开发者导师圈促进职业成长",
  "group.09.prompt": "组织一个技术债务评审委员会，由软件架构师识别系统性问题，资深工程师提出重构策略，产品经理帮助根据业务影响确定优先级。让他们制定平衡的计划，在不停止功能开发的情况下解决技术债务。",
  "group.09.title": "与架构委员会一起优先处理技术债务",
  "group.10.prompt": "创建一个创业创始团队，由专注于愿景和战略的 CEO、评估技术可行性和架构的 CTO，以及规划市场进入策略的 CMO 组成。让他们就产品方向、资源分配、竞争定位和增长策略进行辩论并达成一致。",
  "group.10.title": "模拟创业创始团队讨论",
  "group.11.prompt": "组建一个设计评审小组，由 UX 设计师展示设计，前端开发人员评估实现可行性，产品经理检查与需求的一致性，无障碍专家确保包容性设计。让他们提供建设性反馈并进行迭代。",
  "group.11.title": "与跨职能小组一起评审设计",
  "group.12.prompt": "组建一个 API 设计委员会，由后端架构师、前端消费者代表、技术写作人员和开发者体验倡导者组成。让他们协作设计直观、一致、文档完善且易于使用的 API。",
  "group.12.title": "共同设计开发者友好的 API",
  "group.13.prompt": "创建一个安全评审委员会，由安全工程师、合规官员、后端开发人员和 DevOps 工程师组成。让他们评估系统的安全漏洞、合规差距和运营风险，然后确定修复工作的优先级。",
  "group.13.title": "与专家委员会一起进行安全评审",
  "group.14.prompt": "组织一场回顾会议，由 Scrum Master 引导讨论，团队成员分享成功和挑战，技术主管识别流程改进，产品负责人提供业务背景。让他们制定可执行的改进措施。",
  "group.14.title": "与团队一起进行有效的回顾",
  "group.15.prompt": "组建一个性能优化团队，由性能工程师分析系统性能，数据库专家优化查询，前端专家减少加载时间，DevOps 工程师改进基础设施。让他们协作制定全面的优化计划。",
  "group.15.title": "以团队形式优化系统性能",
  "group.16.prompt": "组建一个数据建模工作坊，由数据架构师、后端开发人员、数据分析师和业务利益相关者参与。让他们协作设计一个平衡技术效率、业务报告需求和未来灵活性的数据模型。",
  "group.16.title": "与利益相关者一起设计数据模型",
  "group.17.prompt": "创建一个迁移规划委员会，由遗留系统专家、云架构师、项目经理和 QA 主管组成。让他们规划复杂的系统迁移，包括风险缓解、回滚策略和最小化业务中断。",
  "group.17.title": "与专家委员会一起规划系统迁移",
  "group.18.prompt": "组织一场开发者体验评审，由平台工程师、开发者布道师、前端和后端开发人员，以及文档专家参与。让他们识别开发工作流中的痛点并提出改进建议。",
  "group.18.title": "共同改善开发者体验",
  "group.19.prompt": "组建一个产品发布团队，由产品经理、市场主管、客户成功经理和工程主管组成。让他们协调发布活动，为潜在问题做好准备，并确保产品顺利发布。",
  "group.19.title": "与跨团队协调产品发布",
  "group.20.prompt": "组建一个招聘委员会，由招聘经理、资深工程师、HR 代表和团队文化倡导者组成。让他们就候选人要求达成一致，设计面试流程，并全面评估候选人。",
  "group.20.title": "共同建立更好的招聘流程",
  "group.21.prompt": "创建一个成本优化特别小组，由云架构师、财务分析师、DevOps 工程师和工程经理组成。让他们识别成本削减机会，同时保持系统性能和可靠性。",
  "group.21.title": "与专家特别小组一起降低云成本",
  "group.22.prompt": "组织一个合规评估团队，由合规官员、安全工程师、法务顾问和技术架构师组成。让他们根据监管要求评估系统并制定合规路线图。",
  "group.22.title": "与跨职能团队一起评估合规性",
  "group.23.prompt": "组建一个创新实验室，由产品愿景家、原型工程师、市场研究员和设计思维者组成。让他们探索新兴技术，快速验证新想法，并提出创新的产品方向。",
  "group.23.title": "与实验室团队一起探索创新",
  "group.24.prompt": "组建一个知识传递会议，由即将离职的团队成员分享背景知识，文档专家记录知识，留任团队成员提出澄清问题。确保关键知识被保存并可访问。",
  "group.24.title": "通过知识传递会议保存知识",
  "group.25.prompt": "创建一个客户反馈评审小组，由产品经理、用户体验研究员、客户成功经理和工程代表组成。让他们综合客户反馈，识别模式，并确定改进的优先级。",
  "group.25.title": "以团队形式评审客户反馈",
  "group.26.prompt": "组织一个测试策略工作坊，由 QA 主管、开发人员、DevOps 工程师和产品经理参与。让他们设计涵盖单元测试、集成测试、端到端测试和性能测试的全面测试策略。",
  "group.26.title": "与团队一起设计测试策略",
  "group.27.prompt": "组建一个文档评审团队，由技术写作人员、领域专家、开发者布道师和最终用户组成。让他们评审和改进文档的清晰度、准确性和实用性。",
  "group.27.title": "与评审团队一起改进文档",
  "group.28.prompt": "组建一个值班轮换规划会议，由 SRE 主管、团队成员、平衡工作量的经理和确保公平实践的 HR 代表参与。设计可持续的值班安排，在保持系统可靠性的同时避免倦怠。",
  "group.28.title": "规划可持续的值班轮换",
  "group.29.prompt": "创建一个技术评估委员会，由技术架构师、将使用该技术的开发人员、安全评审员和考虑总拥有成本的经理组成。让他们系统地评估新工具或框架。",
  "group.29.title": "以委员会形式评估新技术",
  "group.30.prompt": "组织一场事后分析会议，由事件响应者、受影响的团队成员、无责任导向的主持人和管理层观察员参与。让他们分析发生了什么，识别改进点，并承诺执行行动项，但不进行指责。",
  "group.30.title": "进行无指责的事后分析",
  "group.31.prompt": "组建一个无障碍审核团队，由无障碍专家、前端开发人员、UX 设计师和残障用户组成。让他们审核产品的无障碍性问题，并优先修复以改善包容性。",
  "group.31.title": "与多元化团队一起审核无障碍性",
  "group.32.prompt": "组建一个容量规划会议，由工程经理、财务代表、技术架构师和团队主管参与。让他们预测增长，规划招聘，并确保基础设施和团队容量与业务目标一致。",
  "group.32.title": "与领导层一起规划团队容量",
  "group.33.prompt": "创建一个开源贡献评审会，由维护者、社区贡献者、文档评审员和发布经理参与。让他们评审贡献，提供反馈，并协作规划发布。",
  "group.33.title": "共同管理开源贡献",
  "group.34.prompt": "组织一个供应商评估小组，由采购专家、技术评估员、安全评审员和业务利益相关者组成。让他们根据需求评估供应商，协商条款，并做出明智的决策。",
  "group.34.title": "与专家小组一起评估供应商",
  "group.35.prompt": "组建一个灾难恢复规划团队，由 SRE、数据库管理员、安全专家和业务连续性经理组成。让他们设计和验证灾难恢复程序，以最小化停机时间和数据丢失。",
  "group.35.title": "与专家团队一起规划灾难恢复",
  "group.36.prompt": "组建一个指标和 KPI 工作坊，由产品经理、数据分析师、工程主管和业务利益相关者参与。让他们定义有意义的指标，建立基线，并创建推动良好决策的仪表板。",
  "group.36.title": "共同定义指标和 KPI",
  "group.37.prompt": "创建一个代码规范委员会，由来自不同团队的资深开发人员、技术写作人员和工程经理组成。让他们建立编码标准、评审指南和改进代码一致性的流程。",
  "group.37.title": "与委员会一起建立代码规范",
  "group.38.prompt": "组织一场功能开关评审会，由产品经理、开发人员、QA 工程师和发布经理参与。让他们建立功能开关实践，评审现有开关，并规划开关生命周期管理。",
  "group.38.title": "以团队形式管理功能开关",
  "group.39.prompt": "组建一个技术面试设计团队，由招聘经理、资深工程师、HR 代表和多元化倡导者组成。让他们设计公平有效的技术面试，在评估技能的同时提供良好的候选人体验。",
  "group.39.title": "设计更好的技术面试",
  "group.40.prompt": "组建一个平台路线图规划会议，由平台工程师、开发者客户、产品经理和领导层参与。让他们优先考虑能够最大化开发者生产力和业务价值的平台投资。",
  "group.40.title": "与利益相关者一起规划平台路线图",
  "title": "试试这些示例",
  "write.01.prompt": "撰写一篇全面的技术博客文章，以易于理解的方式解释复杂的编程概念。包括能吸引读者的清晰引言、从基础到高级主题的渐进式解释、带有详细注释的实用代码示例、视觉图表描述、真实世界用例、需要避免的常见陷阱，以及包含进一步学习内容的结论。",
  "write.01.title": "撰写包含示例的引人入胜的技术博客文章",
  "write.02.prompt": "为开源项目生成一个完整、专业的 README.md，包括带有徽章的引人注目的项目描述、针对不同平台的清晰安装说明、带有基本用法示例的快速入门指南、包含所有可用选项的全面 API 文档、带有代码风格要求的贡献指南、许可证信息和致谢部分。",
  "write.02.title": "为你的开源项目创建专业的 README",
  "write.03.prompt": "编写开发者真正愿意阅读的详细 API 文档。包括 API 目的和功能概述、带有示例的身份验证和授权要求、带有请求/响应模式的端点参考、多种编程语言的交互式代码示例、带有故障排除提示的全面错误代码文档、速率限制详情和版本控制策略。",
  "write.03.title": "用开发者友好的指南记录你的 API",
  "write.04.prompt": "创建一份技术设计文档，清晰地向技术和非技术利益相关者传达系统架构。包括问题陈述和目标、带有组件图的高级架构概述、详细的数据流描述、带有理由的技术选择、可扩展性和性能考虑、安全措施、测试策略，以及带有风险缓解的上线计划。",
  "write.04.title": "为你的系统编写技术设计文档",
  "write.05.prompt": "编写一份用户友好的指南，帮助用户使用你的软件实现他们的目标。包括带有前提条件的入门部分、带有清晰截图描述的分步说明、有用的提示和快捷方式、常见问题解答、常见问题的故障排除部分，以及为高级用户提供的额外资源链接。",
  "write.05.title": "创建真正帮助用户的用户指南",
  "write.06.prompt": "起草专业的发布说明，让用户了解并对更新感到兴奋。包括发布亮点摘要、带有用法示例的新功能详细描述、所做的改进和优化、已修复的缺陷及问题引用、带有清晰迁移说明的破坏性变更、弃用通知，以及对贡献者的致谢。",
  "write.06.title": "编写用户真正会阅读的发布说明",
  "write.07.prompt": "撰写一份详尽的事后分析报告，将生产事件转化为学习机会。包括执行摘要、详细的事件时间线、使用 5 Whys 等技术的根本原因分析、影响评估（包括受影响的用户和系统）、响应评估（包括做得好的和可以改进的）、带有负责人和截止日期的具体行动项，以及团队的经验教训。",
  "write.07.title": "记录事件事后分析供团队学习",
  "write.08.prompt": "创建一份全面的入职指南，帮助新开发人员快速上手。包括团队介绍和沟通渠道、开发环境设置说明、代码库架构概述和关键目录、编码标准和约定、常见工作流程（如功能开发和代码审查）、调试技巧、有用资源列表，以及第一周建议任务。",
  "write.08.title": "为新团队成员构建入职指南",
  "write.09.prompt": "撰写一份技术 RFC（征求意见稿），提出重大系统变更并征求反馈。包括带有影响的清晰问题陈述、带有详细技术方法的建议解决方案、考虑过的替代方案及其权衡、现有系统的迁移策略、成功指标和监控计划、时间表和资源需求，以及待讨论的开放性问题。",
  "write.09.title": "起草技术 RFC 提出系统变更",
  "write.10.prompt": "撰写一份有说服力的项目提案文档，清晰阐述正在解决的问题及其业务影响，呈现经过深思熟虑的解决方案和技术方法，包括现实的里程碑和时间表，指定资源需求和预算考虑，定义可衡量的成功指标和 KPI，并提出潜在风险的缓解策略。",
  "write.10.title": "起草项目提案以获得利益相关者支持",
  "write.11.prompt": "创建一份全面的测试策略文档，概述软件项目的测试方法。包括测试目标和范围、测试级别（单元测试、集成测试、端到端测试、性能测试）、测试环境要求、测试数据管理策略、自动化方法和工具选择、质量门禁和覆盖率目标，以及角色和职责。",
  "write.11.title": "编写质量保证测试策略",
  "write.12.prompt": "编写一份清晰可操作的运维手册，用于操作生产系统。包括系统概述和架构、常见运维任务的分步说明、监控和告警指南、事件响应程序、故障排除决策树、升级路径，以及带有调度建议的维护程序。",
  "write.12.title": "为你的系统创建运维手册",
  "write.13.prompt": "起草一份安全评估报告，评估应用程序的安全状态。包括给领导层的执行摘要、方法论和范围、按严重程度分类的漏洞发现、带有证据的详细技术描述、风险评级和业务影响、优先排序的修复建议，以及相关标准的合规状态。",
  "write.13.title": "撰写安全评估报告",
  "write.14.prompt": "创建一份数据迁移计划，确保系统之间安全完整的数据传输。包括迁移范围和目标、数据映射和转换规则、验证和核实程序、回滚策略和触发条件、带有里程碑的时间表、利益相关者沟通计划，以及迁移后验证清单。",
  "write.14.title": "用详细文档规划数据迁移",
  "write.15.prompt": "撰写一份性能优化报告，记录发现和建议。包括基线性能指标、负载测试方法论和结果、带有根本原因分析的已识别瓶颈、按影响优先排序的优化建议、实施路线图、带有成功标准的预期改进，以及监控计划。",
  "write.15.title": "记录性能优化发现",
  "write.16.prompt": "创建一份灾难恢复计划，确保业务连续性。包括业务影响分析、恢复目标（RTO/RPO）、关键系统清单和依赖关系、不同场景的恢复程序、通信协议和联系人列表、测试计划和程序，以及计划维护和更新流程。",
  "write.16.title": "编写灾难恢复计划以增强韧性",
  "write.17.prompt": "编写一份代码审查指南，帮助团队成员提供有效的反馈。包括审查目标和原则、需要关注的内容（正确性、性能、安全性、风格）、如何提供建设性反馈、需要注意的常见模式和反模式、审查工作流程和工具，以及良好审查评论的示例。",
  "write.17.title": "为你的团队创建代码审查指南",
  "write.18.prompt": "起草一份针对特定级别工程师招聘的技术面试指南。包括要评估的能力、每个能力的示例问题及跟进问题、带有明确标准的评估量表、需要注意的危险信号和积极信号、面试流程和时间安排，以及候选人体验考虑。",
  "write.18.title": "设计技术面试指南",
  "write.19.prompt": "编写一份全面的变更日志，帮助用户了解版本之间的变化。包括带有发布日期的版本号、分类的变更（新增、变更、弃用、移除、修复、安全）、带有相关文档或问题链接的清晰描述、破坏性变更的迁移说明，以及对贡献者的致谢。",
  "write.19.title": "为你的项目维护有用的变更日志",
  "write.20.prompt": "创建一份软件架构决策记录（ADR），记录重要的技术决策。包括背景和问题陈述、决策驱动因素和约束、考虑过的选项及其优缺点、选择的解决方案及其理由、接受的后果和权衡，以及相关决策或文档。",
  "write.20.title": "用 ADR 记录架构决策",
  "write.21.prompt": "为你的组织编写一份全面的技术写作风格指南。包括语气和语调指南、格式标准、术语偏好和词汇表、代码示例约定、无障碍性要求、评审流程，以及常见文档类型的模板。",
  "write.21.title": "创建技术写作风格指南",
  "write.22.prompt": "起草一份工程团队章程，定义团队的运作方式。包括团队使命和目标、团队组成和角色、决策流程、沟通规范和会议节奏、技术实践和标准、协作约定，以及成功指标和评审流程。",
  "write.22.title": "编写工程团队章程",
  "write.23.prompt": "创建一份供应商评估文档，帮助做出明智的技术决策。包括带有权重的评估标准、供应商比较矩阵、技术评估发现、安全和合规评审、总拥有成本分析、风险评估，以及带有理由的最终建议。",
  "write.23.title": "用结构化文档评估供应商",
  "write.24.prompt": "编写一份产品需求文档（PRD），清晰定义要构建的内容。包括问题陈述和用户需求、用户画像和用例、带有验收标准的功能需求、非功能需求（性能、安全等）、带有线框图的 UI/UX 需求、成功指标，以及带有依赖关系的时间表。",
  "write.24.title": "编写清晰的产品需求文档",
  "write.25.prompt": "创建一份系统集成指南，帮助团队与你的系统连接。包括集成概述和用例、身份验证和授权设置、带有请求/响应示例的 API 端点、Webhook 配置、错误处理和重试策略、测试和调试技巧，以及支持和升级联系人。",
  "write.25.title": "为合作伙伴记录系统集成",
  "write.26.prompt": "撰写一份容量规划文档，预测基础设施需求。包括当前系统指标和趋势、带有假设的增长预测、容量需求分析、扩展策略和触发条件、成本预测和优化机会、实施时间表，以及评审和更新节奏。",
  "write.26.title": "为增长规划基础设施容量",
  "write.27.prompt": "起草一份针对监管要求的合规文档包。包括合规范围和适用法规、控制措施与要求的映射、带有文档的合规证据、差距分析和修复计划、审计准备清单，以及持续合规监控流程。",
  "write.27.title": "为审计准备合规文档",
  "write.28.prompt": "创建一份功能规格文档，指导实现。包括功能概述和业务价值、带有验收标准的用户故事、技术需求和约束、数据模型变更、带有契约的 API 变更、UI 规格、测试需求，以及带有功能开关的上线计划。",
  "write.28.title": "为清晰实现指定功能",
  "write.29.prompt": "编写一篇知识库文章，帮助用户解决特定问题。包括清晰的问题陈述、前提条件和假设、带有截图的分步解决方案、适用时的替代方法、常见问题的故障排除提示、相关文章和后续步骤，以及反馈机制。",
  "write.29.title": "编写解决问题的知识库文章",
  "write.30.prompt": "创建一份冲刺报告，向利益相关者传达进展。包括冲刺目标及是否达成、带有演示或截图的已完成工作、带有解释的未完成工作、指标和趋势（速度、质量等）、遇到的挑战及解决方式、学习和改进，以及下一个冲刺预览。",
  "write.30.title": "编写冲刺报告更新利益相关者",
  "write.31.prompt": "起草一份技术债务清单，跟踪和优先处理代码质量问题。包括债务类别和定义、带有描述的当前债务项目清单、每个项目的影响评估、修复工作量估算、优先级框架和排名、建议的修复路线图，以及跟踪和报告流程。",
  "write.31.title": "记录技术债务以进行战略规划",
  "write.32.prompt": "撰写一份 API 版本控制策略文档，指导长期 API 演进。包括版本控制方案和约定、向后兼容性政策、弃用流程和时间表、迁移支持方法、版本生命周期阶段、变更沟通计划，以及客户端升级指南。",
  "write.32.title": "规划 API 版本控制策略以获得长期成功",
  "write.33.prompt": "为生产系统创建一份监控和告警指南。包括要监控的关键指标、仪表板设计和组织、带有阈值的告警定义、值班响应程序、事件分类标准、升级路径，以及定期评审和调优流程。",
  "write.33.title": "为生产设计监控和告警",
  "write.34.prompt": "编写一份数据库模式文档，帮助开发人员理解数据结构。包括实体关系图、带有列详情的表描述、关系解释、索引策略及其理由、常见查询及其优化、数据生命周期和归档策略，以及变更管理流程。",
  "write.34.title": "为开发人员记录数据库模式",
  "write.35.prompt": "起草一份成本优化报告，识别节省机会。包括按服务划分的当前成本明细、成本趋势和预测、识别的优化机会、带有估计节省的实施建议、每个建议的风险评估、优先行动计划，以及持续监控方法。",
  "write.35.title": "撰写云支出成本优化报告",
  "write.36.prompt": "创建一份工程职业阶梯文档，定义成长路径。包括带有期望的级别定义、每个级别的能力框架、每个级别的示例行为和影响、晋升标准和流程、薪酬理念、职业路径选项（个人贡献者 vs 管理），以及常见问题解答。",
  "write.36.title": "定义工程职业阶梯促进成长",
  "write.37.prompt": "为新功能或系统撰写数据隐私影响评估。包括处理活动描述、数据清单和流程、处理的法律依据、风险识别和评估、隐私控制和缓解措施、数据主体权利实施，以及合规验证清单。",
  "write.37.title": "评估新功能的数据隐私影响",
  "write.38.prompt": "为内部或外部客户创建一份服务级别协议（SLA）文档。包括服务描述和范围、可用性和性能目标、测量方法、事件响应承诺、排除和限制、补救和补偿条款，以及评审和修订流程。",
  "write.38.title": "定义服务级别协议以确保可靠性",
  "write.39.prompt": "撰写一份技术雷达文档，指导技术采用决策。包括雷达格式说明、技术分类（采用、试验、评估、暂缓）、每项技术定位的理由、采用指南和考虑因素、评审和更新节奏，以及建议的贡献流程。",
  "write.39.title": "创建技术雷达以进行战略决策",
  "write.40.prompt": "起草一份完成项目的经验教训文档。包括项目概述和目标、做得好的具体示例、可以改进的内容及其根本原因、意外挑战及其处理方式、对未来项目的建议、量化结果与初始估算的对比，以及团队致谢。",
  "write.40.title": "记录经验教训以持续改进"
}
