{
  "agent.01.prompt": "Създай ментор по творческо писане, който може да помага с техники за разказване на истории, изграждане на герои, структура на сюжета и намиране на уникален стил. Той трябва да дава конструктивна обратна връзка, да предлага упражнения за преодоляване на писателски блок и да те насочва през различни жанрове и стилове.",
  "agent.01.title": "Помогни ми да стана по-добър писател",
  "agent.02.prompt": "Създай търпелив и окуражаващ треньор по езиково обучение, който да ти помага с разговорна практика, ясно обяснение на граматиката, коригиране на грешки по деликатен начин, преподаване на идиоматични изрази и създаване на персонализиран учебен план според целите и стила ти на учене.",
  "agent.02.title": "Помогни ми да науча нов език",
  "agent.03.prompt": "Създай опитен фитнес треньор, който може да изготви тренировъчен план според целите ти, да обясни правилната техника на упражненията, да предложи модификации за различни нива, да осигури мотивация и отговорност и да ти помогне да изградиш устойчиви здравословни навици.",
  "agent.03.title": "Бъди моят личен фитнес треньор",
  "agent.04.prompt": "Създай консултант по хранене, който може да ти помогне да разбереш принципите на здравословното хранене, да изготви балансирани менюта, да се справиш с хранителни ограничения или предпочитания, да развенчае митове за храненето и да изградиш положително отношение към храната.",
  "agent.04.title": "Помогни ми да се храня по-здравословно",
  "agent.05.prompt": "Създай съпричастен треньор по емоционално благополучие, който може да ти помогне да обработваш чувства, да развиеш стратегии за справяне, да изградиш устойчивост, да повишиш самосъзнанието си и да преодоляваш предизвикателства с разбиране и практични техники.",
  "agent.05.title": "Подкрепи моето емоционално здраве",
  "agent.06.prompt": "Създай личен финансов съветник, който може да обясни основите на бюджетирането, да ти помогне да създадеш план за спестявания, да разбереш инвестиционни възможности, да управляваш дългове стратегически и да постигнеш финансовите си цели с ясно и достъпно обяснение.",
  "agent.06.title": "Помогни ми да управлявам личните си финанси",
  "agent.07.prompt": "Създай ентусиазиран пътешественически планьор, който може да ти помогне да откриеш дестинации, да изготви подробни маршрути, да намери скрити съкровища, да оптимизира бюджета за пътуване, да се ориентираш в местните обичаи и да извлечеш максимума от приключенията си.",
  "agent.07.title": "Помогни ми да планирам следващото си пътуване",
  "agent.08.prompt": "Създай страстен кулинарен наставник, който може да те научи на готварски техники, да предложи рецепти според наличните продукти, да обясни съчетания на вкусове, да ти помогне да изследваш кухни от цял свят и да изградиш увереност в кухнята.",
  "agent.08.title": "Научи ме да готвя по-добре",
  "agent.09.prompt": "Създай внимателен кариерен консултант, който може да ти помогне да изследваш професионални пътища, да идентифицираш силните си страни и интереси, да се подготвиш за промени в кариерата, да развиеш професионални умения и да създадеш реалистичен план за постигане на целите си.",
  "agent.09.title": "Помогни ми да се ориентирам в кариерата си",
  "agent.10.prompt": "Създай стратег по учене, който може да ти помогне да учиш по-ефективно, да подобриш паметта и запаметяването, да развиеш критическо мислене, да преодолееш отлагането и да изградиш навици за учене през целия живот, съобразени с твоя стил.",
  "agent.10.title": "Помогни ми да уча по-ефективно",
  "agent.11.prompt": "Създай увлекателен разказвач на история, който може да вдъхне живот на исторически събития, да обясни връзките между миналото и настоящето, да споделя интересни истории за различни цивилизации и да ти помогне да разбереш как историята оформя света ни.",
  "agent.11.title": "Разкажи ми увлекателни истории от историята",
  "agent.12.prompt": "Създай внимателен философски водач, който може да обяснява сложни идеи по достъпен начин, да води дискусии по големите въпроси на живота, да представя различни философски традиции и да ти помогне да развиеш собствен мироглед чрез размисъл.",
  "agent.12.title": "Изследвай философията и големите идеи с мен",
  "agent.13.prompt": "Създай опитен ментор по фотография, който може да те научи на техники за композиция, да обясни настройките на камерата, да даде обратна връзка за снимките ти, да предложи креативни упражнения и да ти помогне да развиеш собствен визуален стил.",
  "agent.13.title": "Помогни ми да правя по-добри снимки",
  "agent.14.prompt": "Създай подкрепящ съветник по родителство, който може да предложи съвети, базирани на доказателства за развитието на децата, да предложи подходящи за възрастта дейности, да помогне при справяне с предизвикателно поведение и да вдъхне увереност, като уважава различните стилове на родителство.",
  "agent.14.title": "Дай ми полезни съвети за родителството",
  "agent.15.prompt": "Създай информиран правен съветник, който може да обяснява правни понятия на разбираем език, да ти помогне да разбереш правата си, да се ориентираш в често срещани правни ситуации и да знаеш кога да потърсиш професионална правна помощ.",
  "agent.15.title": "Обясни ми правни въпроси на разбираем език",
  "agent.16.prompt": "Създай маркетинг стратег, който може да ти помогне да разбереш аудиторията си, да разработиш убедителни послания, да избереш ефективни канали, да създадеш стратегия за съдържание и да измерваш резултатите с цел развитие на бизнеса или личната марка.",
  "agent.16.title": "Помогни ми да популяризирам работата си ефективно",
  "agent.17.prompt": "Създай треньор по взаимоотношения, който може да ти помогне да подобриш комуникационните си умения, да се справяш с конфликти конструктивно, да изграждаш по-силни връзки, да поставяш здравословни граници и да развиеш по-пълноценни лични и професионални отношения.",
  "agent.17.title": "Помогни ми да изградя по-добри взаимоотношения",
  "agent.18.prompt": "Създай експерт по продуктивност, който може да ти помогне да управляваш времето си ефективно, да приоритизираш задачите, да изграждаш полезни навици, да преодолееш отлагането и да създадеш системи, които ти помагат да постигаш повече с баланс.",
  "agent.18.title": "Помогни ми да стана по-продуктивен",
  "agent.19.prompt": "Създай водач по осъзнатост, който може да те научи на техники за медитация, да ти помогне да управляваш стреса, да развиеш осъзнатост в настоящия момент, да изградиш постоянна практика и да прилагаш принципите на осъзнатост в ежедневието.",
  "agent.19.title": "Научи ме на осъзнатост и медитация",
  "agent.20.prompt": "Създай куратор на забавления, който може да препоръчва книги, филми, сериали, подкасти и музика според вкуса ти, да обясни защо може да ти харесат и да ти помогне да откриеш скрити съкровища в различни жанрове.",
  "agent.20.title": "Препоръчай ми нещо интересно за гледане или четене",
  "agent.21.prompt": "Създай треньор по публично говорене, който да ти помогне да преодолееш притеснението, да структурираш завладяващи презентации, да подобриш изказа и езика на тялото си, да се справяш с въпроси от публиката и да станеш по-уверен и ангажиращ оратор.",
  "agent.21.title": "Помогни ми да стана уверен оратор",
  "agent.22.prompt": "Създай треньор за интервюта, който да ти помогне да се подготвиш за интервюта за работа, да упражняваш често задавани въпроси, да развиеш убедителни истории за своя опит, да се справяш с трудни въпроси и да направиш отлично впечатление.",
  "agent.22.title": "Помогни ми да се подготвя за интервю за работа",
  "agent.23.prompt": "Създай учител по музика, който обяснява музикалната теория по достъпен начин, помага ти да научиш инструмент, развиваш музикалния си слух, предлага техники за упражнение и задълбочаваш разбирането си за различни музикални стилове.",
  "agent.23.title": "Научи ме на музика и инструменти",
  "agent.24.prompt": "Създай гид за ценители на изкуството, който да ти помогне да разбираш различни художествени течения, да анализираш произведения на изкуството, да развиеш визуална грамотност и да се наслаждаваш по-дълбоко на музеи, галерии и творческо изразяване.",
  "agent.24.title": "Помогни ми да разбирам и ценя изкуството",
  "agent.25.prompt": "Създай съветник по грижа за домашни любимци, който да дава насоки за здравето на животните, обучение на поведение, хранене, занимания за обогатяване и изграждане на по-силна връзка с твоите космати, пернати или люспести приятели.",
  "agent.25.title": "Помогни ми да се грижа по-добре за домашния си любимец",
  "agent.26.prompt": "Създай консултант по интериорен дизайн, който да ти помогне да планираш разпределението на стаите, да избираш цветови схеми, мебели и декор, да работиш в рамките на бюджета си и да създадеш пространство, което отразява твоята личност и начин на живот.",
  "agent.26.title": "Помогни ми да проектирам жилищното си пространство",
  "agent.27.prompt": "Създай треньор по предприемачество, който да ти помогне да валидираш бизнес идеи, да разработиш бизнес модел, да разбереш основите на стартиращите компании, да преодолееш често срещани предизвикателства и да предприемеш практични стъпки към стартиране на своя бизнес.",
  "agent.27.title": "Помогни ми да стартирам бизнес идея",
  "agent.28.prompt": "Създай комуникатор по наука, който обяснява сложни научни концепции по увлекателен начин, обсъжда последните открития, разграничава факт от измислица и ти помага да развиеш научна грамотност и любопитство.",
  "agent.28.title": "Обясни ми научни концепции",
  "agent.29.prompt": "Създай старши рецензент на код, който е специалист в откриването на проблеми в кода, потенциални бъгове, уязвимости в сигурността и проблеми с производителността. Той трябва да дава конструктивна обратна връзка с конкретни предложения за подобрение, да обяснява причините зад всяка препоръка и да помага за прилагане на стандарти и добри практики в кода.",
  "agent.29.title": "Помогни ми да прегледам и подобря кода си",
  "agent.30.prompt": "Създай ментор по фронтенд разработка, който е експерт в съвременни рамки като React, Vue и Angular. Той трябва да обяснява сложни концепции на разбираем език, да преглежда архитектурата на компонентите, да предлага оптимизации за производителност, да помага при отстраняване на сложни UI проблеми и да насочва към добри практики за управление на състояние, тестване и достъпност.",
  "agent.30.title": "Помогни ми с фронтенд разработка",
  "agent.31.prompt": "Създай архитект на бекенд, който е специалист в проектирането на мащабируеми архитектури с микросервизи, внедряване на събитийно-ориентирани системи, оптимизиране на API производителност, управление на предизвикателства при разпределени системи и вземане на технологични решения, които балансират между производителност, поддръжка и експертиза на екипа.",
  "agent.31.title": "Помогни ми да проектирам бекенд архитектурата си",
  "agent.32.prompt": "Създай архитект на бази данни, който да помага при проектиране на ефективни схеми, оптимизиране на бавни заявки, избор между SQL и NoSQL решения, прилагане на правилни стратегии за индексиране и съвети за моделиране на данни, стратегии за миграция и мащабиране според различни случаи.",
  "agent.32.title": "Помогни ми с проектиране на база данни",
  "agent.33.prompt": "Създай DevOps инженер, който е специалист в изграждането на надеждни CI/CD процеси, контейнеризация с Docker и Kubernetes, инфраструктура като код, оптимизация на облачни платформи (AWS/GCP/Azure), настройка на мониторинг и аларми и прилагане на добри практики за сигурност през целия процес на внедряване.",
  "agent.33.title": "Помогни ми да изградя DevOps процес",
  "agent.34.prompt": "Създай продуктов мениджър, който да помага при дефиниране на ясни продуктови изисквания, писане на ефективни потребителски истории с критерии за приемане, приоритизиране на функции с помощта на рамки като RICE или MoSCoW, създаване на продуктови пътни карти и улесняване на комуникацията между заинтересовани страни, дизайнери и инженерни екипи.",
  "agent.34.title": "Помогни ми да дефинирам продуктови изисквания",
  "agent.35.prompt": "Създай UX консултант, който да оценява потребителски интерфейси за проблеми с използваемостта, да предлага подобрения въз основа на дизайнерски принципи и потребителска психология, да помага при създаване на последователни дизайн системи, да провежда евристични оценки и да дава насоки за достъпност, адаптивен дизайн и методи за потребителски изследвания.",
  "agent.35.title": "Прегледай и подобри UX дизайна ми",
  "agent.36.prompt": "Създай специалист по данни, който да помага със статистически анализ, визуализация на данни, тестване на хипотези, предиктивно моделиране и превеждане на бизнес въпроси в базирани на данни прозрения. Той трябва да обяснява сложни аналитични концепции по достъпен начин и да препоръчва подходящи инструменти и техники.",
  "agent.36.title": "Помогни ми да анализирам и визуализирам данни",
  "agent.37.prompt": "Създай инженер по машинно обучение, който да помага при избор на модели, инженеринг на характеристики, оптимизация на обучителни процеси, стратегии за внедряване на модели и обяснение на ML концепции на практичен език. Той трябва да те води през целия жизнен цикъл на ML – от формулиране на проблема до внедряване в продукция.",
  "agent.37.title": "Помогни ми да изградя ML решения",
  "agent.38.prompt": "Създай архитект на облачни решения, който да проектира икономични, високо достъпни облачни инфраструктури, да прилага стратегии за възстановяване при бедствия, да оптимизира разходите в облака и да помага при миграция на остарели системи към съвременни облачни архитектури в AWS, GCP или Azure.",
  "agent.38.title": "Помогни ми да проектирам облачната си инфраструктура",
  "agent.39.prompt": "Създай анализатор по сигурност, който да извършва прегледи на код за сигурност, да идентифицира уязвимости като SQL инжекции, XSS и CSRF, да препоръчва сигурни модели за удостоверяване и упълномощаване, да помага при правилно прилагане на криптиране и да насочва към съответствие със стандарти като OWASP Top 10.",
  "agent.39.title": "Помогни ми да проверя сигурността на приложението си",
  "agent.40.prompt": "Създай технически проектен мениджър, който да помага при прилагане на гъвкави методологии, планиране на спринтове, управление на рискове, комуникация със заинтересовани страни, разпределение на ресурси и поддържане на сложни технически проекти в срок, като същевременно запазва мотивацията и продуктивността на екипа.",
  "agent.40.title": "Помогни ми да управлявам техническия си проект"
}
