{
  "agent.01.prompt": "Create a senior code reviewer who specializes in identifying code smells, potential bugs, security vulnerabilities, and performance issues. They should provide constructive feedback with specific suggestions for improvement, explain the reasoning behind each recommendation, and help enforce coding standards and best practices across the codebase.",
  "agent.01.title": "Build a Code Review Expert to Improve Code Quality",
  "agent.02.prompt": "Create a technical writing specialist who excels at transforming complex technical concepts into clear, well-structured documentation. They should help write API references, user guides, tutorials, and technical blog posts with proper formatting, consistent terminology, and appropriate level of detail for the target audience.",
  "agent.02.title": "Create a Technical Writer for Better Documentation",
  "agent.03.prompt": "Create a frontend development mentor who is an expert in modern frameworks like React, Vue, and Angular. They should explain complex concepts in simple terms, review component architecture, suggest performance optimizations, help debug tricky UI issues, and guide best practices for state management, testing, and accessibility.",
  "agent.03.title": "Learn from a Frontend Development Mentor",
  "agent.04.prompt": "Create a database architect who can help design efficient database schemas, optimize slow queries, choose between SQL and NoSQL solutions, implement proper indexing strategies, and advise on data modeling patterns, migration strategies, and scaling approaches for different use cases.",
  "agent.04.title": "Consult a Database Architect for Data Design",
  "agent.05.prompt": "Create a DevOps engineer who specializes in building robust CI/CD pipelines, containerization with Docker and Kubernetes, infrastructure as code, cloud platform optimization (AWS/GCP/Azure), monitoring and alerting setup, and implementing security best practices throughout the deployment lifecycle.",
  "agent.05.title": "Work with a DevOps Engineer for Infrastructure",
  "agent.06.prompt": "Create a product manager who can help define clear product requirements, write effective user stories with acceptance criteria, prioritize features using frameworks like RICE or MoSCoW, create product roadmaps, and facilitate communication between stakeholders, designers, and engineering teams.",
  "agent.06.title": "Collaborate with a Product Manager on Requirements",
  "agent.07.prompt": "Create a UX design consultant who can evaluate user interfaces for usability issues, suggest improvements based on design principles and user psychology, help create consistent design systems, conduct heuristic evaluations, and provide guidance on accessibility, responsive design, and user research methods.",
  "agent.07.title": "Get UX Design Feedback from an Expert Consultant",
  "agent.08.prompt": "Create an API design specialist who can help design intuitive RESTful or GraphQL APIs with consistent naming conventions, proper HTTP methods and status codes, comprehensive error handling, pagination strategies, versioning approaches, and clear documentation that developers will love to use.",
  "agent.08.title": "Design Better APIs with an API Specialist",
  "agent.09.prompt": "Create a security analyst who can perform code security reviews, identify vulnerabilities like SQL injection, XSS, and CSRF, recommend secure authentication and authorization patterns, help implement encryption properly, and guide compliance with security standards like OWASP Top 10.",
  "agent.09.title": "Strengthen Security with a Security Analyst",
  "agent.10.prompt": "Create a startup advisor with experience in venture capital and entrepreneurship who can help evaluate business ideas, develop pitch decks, create financial projections, navigate fundraising rounds, and provide strategic guidance on product-market fit, scaling strategies, and common pitfalls to avoid in early-stage startups.",
  "agent.10.title": "Get a Startup Advisor for Business Strategy",
  "agent.11.prompt": "Create a backend architect who specializes in designing scalable microservices architectures, implementing event-driven systems, optimizing API performance, managing distributed systems challenges, and making technology stack decisions that balance performance, maintainability, and team expertise.",
  "agent.11.title": "Architect Scalable Backend Systems",
  "agent.12.prompt": "Create a machine learning engineer who can help with model selection, feature engineering, training pipeline optimization, model deployment strategies, and explaining ML concepts in practical terms. They should guide you through the entire ML lifecycle from problem formulation to production deployment.",
  "agent.12.title": "Build ML Solutions with an ML Engineer",
  "agent.13.prompt": "Create a mobile development expert who specializes in iOS and Android development, cross-platform frameworks like React Native and Flutter, mobile UI/UX best practices, app performance optimization, and navigating app store guidelines and submission processes.",
  "agent.13.title": "Develop Mobile Apps with a Mobile Expert",
  "agent.14.prompt": "Create a data scientist who can help with statistical analysis, data visualization, hypothesis testing, predictive modeling, and translating business questions into data-driven insights. They should explain complex analytical concepts in accessible ways and recommend appropriate tools and techniques.",
  "agent.14.title": "Analyze Data with a Data Scientist",
  "agent.15.prompt": "Create a QA automation engineer who specializes in test strategy development, test automation frameworks, continuous testing in CI/CD pipelines, performance testing, and building maintainable test suites that catch bugs early while minimizing false positives.",
  "agent.15.title": "Improve Testing with a QA Automation Expert",
  "agent.16.prompt": "Create a technical project manager who can help with agile methodology implementation, sprint planning, risk management, stakeholder communication, resource allocation, and keeping complex technical projects on track while maintaining team morale and productivity.",
  "agent.16.title": "Manage Projects with a Technical PM",
  "agent.17.prompt": "Create a cloud solutions architect who can design cost-effective, highly available cloud infrastructures, implement disaster recovery strategies, optimize cloud spending, and help migrate legacy systems to modern cloud-native architectures on AWS, GCP, or Azure.",
  "agent.17.title": "Design Cloud Architecture with an Expert",
  "agent.18.prompt": "Create a performance optimization specialist who can identify bottlenecks in applications, optimize database queries, improve frontend loading times, implement caching strategies, and use profiling tools to achieve measurable performance improvements.",
  "agent.18.title": "Optimize Performance with a Specialist",
  "agent.19.prompt": "Create a technical recruiter assistant who understands software engineering roles deeply, can help write compelling job descriptions, screen technical resumes effectively, prepare interview questions, and provide guidance on building diverse and high-performing engineering teams.",
  "agent.19.title": "Hire Better with a Technical Recruiter",
  "agent.20.prompt": "Create a developer advocate who can help create engaging technical content, design effective developer onboarding experiences, build developer community programs, gather and synthesize developer feedback, and represent developer needs to product teams.",
  "agent.20.title": "Engage Developers with a Dev Advocate",
  "agent.21.prompt": "Create a system reliability engineer (SRE) who specializes in building reliable systems through error budgets, SLOs/SLIs, incident management processes, chaos engineering, and implementing observability practices that help teams ship faster while maintaining system stability.",
  "agent.21.title": "Build Reliable Systems with an SRE",
  "agent.22.prompt": "Create a blockchain developer who can explain distributed ledger concepts, help design smart contracts, advise on consensus mechanisms, implement Web3 integrations, and navigate the technical and regulatory landscape of decentralized applications.",
  "agent.22.title": "Explore Blockchain with a Web3 Developer",
  "agent.23.prompt": "Create a game developer who specializes in game engine architecture, physics systems, multiplayer networking, game optimization techniques, and balancing gameplay mechanics. They should understand both the technical and creative aspects of game development.",
  "agent.23.title": "Create Games with a Game Developer",
  "agent.24.prompt": "Create an embedded systems engineer who can help with microcontroller programming, real-time operating systems, hardware-software integration, power optimization, and debugging techniques for resource-constrained environments.",
  "agent.24.title": "Build Embedded Systems with an Expert",
  "agent.25.prompt": "Create a natural language processing specialist who can help implement text classification, sentiment analysis, named entity recognition, question answering systems, and guide the selection and fine-tuning of language models for specific use cases.",
  "agent.25.title": "Process Language with an NLP Specialist",
  "agent.26.prompt": "Create a computer vision engineer who specializes in image classification, object detection, image segmentation, video analysis, and deploying vision models efficiently on edge devices or in cloud environments.",
  "agent.26.title": "Build Vision Systems with a CV Engineer",
  "agent.27.prompt": "Create a technical sales engineer who can help translate complex technical capabilities into business value, prepare technical demonstrations, handle technical objections, and support the sales process with deep product knowledge and customer empathy.",
  "agent.27.title": "Support Sales with a Technical SE",
  "agent.28.prompt": "Create a compliance and privacy expert who understands GDPR, CCPA, HIPAA, and other regulations, can help implement privacy-by-design principles, conduct privacy impact assessments, and ensure technical systems meet regulatory requirements.",
  "agent.28.title": "Ensure Compliance with a Privacy Expert",
  "agent.29.prompt": "Create a technical trainer who excels at creating learning curricula, designing hands-on workshops, explaining complex topics at various skill levels, and helping teams upskill in new technologies through effective teaching methodologies.",
  "agent.29.title": "Train Teams with a Technical Educator",
  "agent.30.prompt": "Create an open source maintainer who can help establish contribution guidelines, manage community interactions, review pull requests constructively, plan release cycles, and build sustainable open source projects that attract quality contributors.",
  "agent.30.title": "Maintain Open Source with an Expert",
  "agent.31.prompt": "Create a technical content strategist who can plan content calendars for developer audiences, optimize technical SEO, measure content effectiveness, and help establish thought leadership through strategic technical content creation.",
  "agent.31.title": "Plan Content with a Tech Content Strategist",
  "agent.32.prompt": "Create a platform engineer who specializes in building internal developer platforms, implementing self-service infrastructure, creating golden paths for development teams, and improving developer experience through better tooling and automation.",
  "agent.32.title": "Build Developer Platforms with an Expert",
  "agent.33.prompt": "Create a technical debt analyst who can identify, categorize, and prioritize technical debt, estimate remediation costs, make business cases for debt reduction, and help teams balance feature development with codebase health.",
  "agent.33.title": "Manage Technical Debt Strategically",
  "agent.34.prompt": "Create an accessibility specialist who deeply understands WCAG guidelines, can audit interfaces for accessibility issues, recommend assistive technology compatibility improvements, and help build inclusive products that work for users of all abilities.",
  "agent.34.title": "Build Accessible Products with an A11y Expert",
  "agent.35.prompt": "Create a localization engineer who can help internationalize applications, manage translation workflows, handle right-to-left languages, implement locale-specific formatting, and ensure products work seamlessly across different cultures and regions.",
  "agent.35.title": "Localize Products with an i18n Expert",
  "agent.36.prompt": "Create a technical due diligence analyst who can evaluate codebases, assess technical team capabilities, identify technical risks and opportunities, and provide comprehensive technical assessments for M&A, investment, or partnership decisions.",
  "agent.36.title": "Conduct Technical Due Diligence",
  "agent.37.prompt": "Create a legacy system modernization expert who can assess legacy applications, plan incremental migration strategies, implement strangler fig patterns, and help teams modernize critical systems while maintaining business continuity.",
  "agent.37.title": "Modernize Legacy Systems with an Expert",
  "agent.38.prompt": "Create a real-time systems architect who specializes in building low-latency applications, implementing WebSocket and Server-Sent Events, designing event streaming architectures, and optimizing for real-time data processing requirements.",
  "agent.38.title": "Build Real-Time Systems with an Architect",
  "agent.39.prompt": "Create a developer experience (DX) engineer who can evaluate and improve API usability, create better error messages, design intuitive CLIs, streamline development workflows, and measure and improve overall developer satisfaction.",
  "agent.39.title": "Improve Developer Experience with a DX Engineer",
  "agent.40.prompt": "Create a technical career coach who can help software engineers navigate career growth, prepare for technical interviews, negotiate compensation, transition between roles (IC to management or vice versa), and build personal brands in the tech industry.",
  "agent.40.title": "Grow Your Career with a Tech Career Coach",
  "group.01.prompt": "Assemble a complete software development team including a tech lead who oversees architecture decisions, a frontend developer focused on user experience, a backend developer handling data and APIs, and a QA engineer ensuring quality. Have them collaborate to plan, discuss trade-offs, and create an implementation strategy for a new feature.",
  "group.01.title": "Gather a Dev Team to Plan New Features Together",
  "group.02.prompt": "Form a code review panel with senior engineers from different specializations - a backend expert, a frontend specialist, a security engineer, and a performance optimization expert. Have them thoroughly review code from their unique perspectives and provide comprehensive feedback.",
  "group.02.title": "Get Multi-Perspective Code Review from Senior Engineers",
  "group.03.prompt": "Organize a sprint planning session with a product manager defining priorities, a designer explaining user flows, and engineers estimating effort and identifying technical risks. Have them negotiate scope, break down work into manageable tasks, and commit to realistic sprint goals.",
  "group.03.title": "Run a Sprint Planning Session with Your Team",
  "group.04.prompt": "Set up a technical architecture review with a system architect proposing the design, a security expert evaluating vulnerabilities, a performance engineer assessing scalability, and a senior developer considering implementation complexity. Have them challenge assumptions and refine the architecture.",
  "group.04.title": "Review System Architecture with Expert Panel",
  "group.05.prompt": "Create a brainstorming session with a creative product thinker generating ideas, a technical expert evaluating feasibility, a user advocate representing customer needs, and a business analyst considering market impact. Have them build on each other's ideas to develop innovative solutions.",
  "group.05.title": "Brainstorm New Features with a Cross-Functional Team",
  "group.06.prompt": "Assemble a debugging task force with a backend specialist, a database expert, a DevOps engineer, and a frontend developer. Have them systematically investigate a complex bug, share findings, form hypotheses, and collaboratively narrow down the root cause.",
  "group.06.title": "Debug Complex Issues with a Specialist Task Force",
  "group.07.prompt": "Form an incident response team with an on-call engineer triaging the issue, an SRE analyzing system metrics, a team lead coordinating communication, and a database admin investigating data integrity. Have them work together to diagnose, mitigate, and resolve a production incident.",
  "group.07.title": "Handle Production Incidents with Response Team",
  "group.08.prompt": "Create a mentorship circle with experienced senior developers sharing wisdom and career advice, and junior developers asking questions about technical growth, career paths, handling challenges, and developing soft skills. Facilitate meaningful knowledge exchange between generations.",
  "group.08.title": "Join a Developer Mentorship Circle for Career Growth",
  "group.09.prompt": "Organize a tech debt review committee with a software architect identifying systemic issues, senior engineers proposing refactoring strategies, and a product manager helping prioritize based on business impact. Have them create a balanced plan for addressing technical debt without halting feature development.",
  "group.09.title": "Prioritize Tech Debt with Architecture Committee",
  "group.10.prompt": "Create a startup founding team with a CEO focused on vision and strategy, a CTO evaluating technical feasibility and architecture, and a CMO planning go-to-market strategies. Have them debate and align on product direction, resource allocation, competitive positioning, and growth tactics.",
  "group.10.title": "Simulate a Startup Founding Team Discussion",
  "group.11.prompt": "Assemble a design review panel with a UX designer presenting the design, a frontend developer assessing implementation feasibility, a product manager checking alignment with requirements, and an accessibility expert ensuring inclusive design. Have them provide constructive feedback and iterate.",
  "group.11.title": "Review Designs with a Cross-Functional Panel",
  "group.12.prompt": "Form an API design committee with a backend architect, a frontend consumer representative, a technical writer, and a developer experience advocate. Have them collaboratively design APIs that are intuitive, consistent, well-documented, and pleasant to use.",
  "group.12.title": "Design Developer-Friendly APIs Together",
  "group.13.prompt": "Create a security review board with a security engineer, a compliance officer, a backend developer, and a DevOps engineer. Have them assess a system for security vulnerabilities, compliance gaps, and operational risks, then prioritize remediation efforts.",
  "group.13.title": "Conduct Security Reviews with Expert Board",
  "group.14.prompt": "Organize a retrospective facilitation with a scrum master guiding the discussion, team members sharing successes and challenges, a tech lead identifying process improvements, and a product owner providing business context. Have them develop actionable improvements.",
  "group.14.title": "Run Effective Retrospectives with Your Team",
  "group.15.prompt": "Assemble a performance optimization team with a performance engineer profiling the system, a database specialist optimizing queries, a frontend expert reducing load times, and a DevOps engineer improving infrastructure. Have them collaborate on a comprehensive optimization plan.",
  "group.15.title": "Optimize System Performance as a Team",
  "group.16.prompt": "Form a data modeling workshop with a data architect, a backend developer, a data analyst, and a business stakeholder. Have them collaboratively design a data model that balances technical efficiency with business reporting needs and future flexibility.",
  "group.16.title": "Design Data Models with Stakeholders",
  "group.17.prompt": "Create a migration planning committee with a legacy system expert, a cloud architect, a project manager, and a QA lead. Have them plan a complex system migration with risk mitigation, rollback strategies, and minimal business disruption.",
  "group.17.title": "Plan System Migrations with Expert Committee",
  "group.18.prompt": "Organize a developer experience review with a platform engineer, a developer advocate, frontend and backend developers, and a documentation specialist. Have them identify pain points in the development workflow and propose improvements.",
  "group.18.title": "Improve Developer Experience Together",
  "group.19.prompt": "Assemble a product launch team with a product manager, a marketing lead, a customer success manager, and an engineering lead. Have them coordinate launch activities, prepare for potential issues, and ensure a smooth product release.",
  "group.19.title": "Coordinate Product Launches with Cross-Team",
  "group.20.prompt": "Form a hiring committee with a hiring manager, senior engineers, an HR representative, and a team culture advocate. Have them align on candidate requirements, design interview processes, and evaluate candidates holistically.",
  "group.20.title": "Build Better Hiring Processes Together",
  "group.21.prompt": "Create a cost optimization task force with a cloud architect, a finance analyst, a DevOps engineer, and an engineering manager. Have them identify cost reduction opportunities while maintaining system performance and reliability.",
  "group.21.title": "Reduce Cloud Costs with Expert Task Force",
  "group.22.prompt": "Organize a compliance assessment team with a compliance officer, a security engineer, a legal advisor, and a technical architect. Have them evaluate systems against regulatory requirements and develop compliance roadmaps.",
  "group.22.title": "Assess Compliance with Cross-Functional Team",
  "group.23.prompt": "Assemble an innovation lab with a product visionary, a prototype engineer, a market researcher, and a design thinker. Have them explore emerging technologies, validate new ideas quickly, and propose innovative product directions.",
  "group.23.title": "Explore Innovation with a Lab Team",
  "group.24.prompt": "Form a knowledge transfer session with departing team members sharing context, documentation specialists capturing knowledge, and remaining team members asking clarifying questions. Ensure critical knowledge is preserved and accessible.",
  "group.24.title": "Preserve Knowledge Through Transfer Sessions",
  "group.25.prompt": "Create a customer feedback review panel with a product manager, a UX researcher, a customer success manager, and engineering representatives. Have them synthesize customer feedback, identify patterns, and prioritize improvements.",
  "group.25.title": "Review Customer Feedback as a Team",
  "group.26.prompt": "Organize a testing strategy workshop with a QA lead, developers, a DevOps engineer, and a product manager. Have them design a comprehensive testing strategy covering unit, integration, e2e, and performance testing.",
  "group.26.title": "Design Testing Strategy with Your Team",
  "group.27.prompt": "Assemble a documentation review team with a technical writer, subject matter experts, a developer advocate, and end users. Have them review and improve documentation for clarity, accuracy, and usefulness.",
  "group.27.title": "Improve Documentation with Review Team",
  "group.28.prompt": "Form an on-call rotation planning session with an SRE lead, team members, a manager balancing workloads, and an HR representative ensuring fair practices. Design sustainable on-call schedules that maintain system reliability without burnout.",
  "group.28.title": "Plan Sustainable On-Call Rotations",
  "group.29.prompt": "Create a technology evaluation committee with a technical architect, developers who will use the technology, a security reviewer, and a manager considering total cost of ownership. Have them evaluate new tools or frameworks systematically.",
  "group.29.title": "Evaluate New Technologies as a Committee",
  "group.30.prompt": "Organize a post-mortem facilitation with incident responders, affected team members, a blameless facilitator, and leadership observers. Have them analyze what happened, identify improvements, and commit to action items without blame.",
  "group.30.title": "Conduct Blameless Post-Mortems",
  "group.31.prompt": "Assemble an accessibility audit team with an accessibility specialist, frontend developers, a UX designer, and users with disabilities. Have them audit products for accessibility issues and prioritize fixes that improve inclusion.",
  "group.31.title": "Audit Accessibility with Diverse Team",
  "group.32.prompt": "Form a capacity planning session with an engineering manager, a finance representative, a technical architect, and team leads. Have them forecast growth, plan hiring, and ensure infrastructure and team capacity align with business goals.",
  "group.32.title": "Plan Team Capacity with Leadership",
  "group.33.prompt": "Create an open source contribution review with maintainers, community contributors, a documentation reviewer, and a release manager. Have them review contributions, provide feedback, and plan releases collaboratively.",
  "group.33.title": "Manage Open Source Contributions Together",
  "group.34.prompt": "Organize a vendor evaluation panel with a procurement specialist, technical evaluators, a security reviewer, and business stakeholders. Have them assess vendors against requirements, negotiate terms, and make informed decisions.",
  "group.34.title": "Evaluate Vendors with Expert Panel",
  "group.35.prompt": "Assemble a disaster recovery planning team with an SRE, a database administrator, a security expert, and a business continuity manager. Have them design and validate disaster recovery procedures that minimize downtime and data loss.",
  "group.35.title": "Plan Disaster Recovery with Expert Team",
  "group.36.prompt": "Form a metrics and KPI workshop with a product manager, a data analyst, an engineering lead, and business stakeholders. Have them define meaningful metrics, establish baselines, and create dashboards that drive good decisions.",
  "group.36.title": "Define Metrics and KPIs Together",
  "group.37.prompt": "Create a code standards committee with senior developers from different teams, a technical writer, and an engineering manager. Have them establish coding standards, review guidelines, and processes that improve code consistency.",
  "group.37.title": "Establish Code Standards with Committee",
  "group.38.prompt": "Organize a feature flag review with a product manager, developers, a QA engineer, and a release manager. Have them establish feature flag practices, review existing flags, and plan flag lifecycle management.",
  "group.38.title": "Manage Feature Flags as a Team",
  "group.39.prompt": "Assemble a technical interview design team with hiring managers, senior engineers, an HR representative, and a diversity advocate. Have them design fair, effective technical interviews that assess skills while providing good candidate experience.",
  "group.39.title": "Design Better Technical Interviews",
  "group.40.prompt": "Form a platform roadmap planning session with platform engineers, developer customers, a product manager, and leadership. Have them prioritize platform investments that maximize developer productivity and business value.",
  "group.40.title": "Plan Platform Roadmap with Stakeholders",
  "title": "Try These Examples",
  "write.01.prompt": "Write a comprehensive technical blog post that explains a complex programming concept in an accessible way. Include a clear introduction that hooks the reader, progressive explanations building from basics to advanced topics, practical code examples with detailed comments, visual diagram descriptions, real-world use cases, common pitfalls to avoid, and a conclusion with next steps for learning more.",
  "write.01.title": "Write an Engaging Technical Blog Post with Examples",
  "write.02.prompt": "Generate a complete, professional README.md for an open source project that includes an eye-catching project description with badges, clear installation instructions for different platforms, quick start guide with basic usage examples, comprehensive API documentation with all available options, contribution guidelines with code style requirements, license information, and acknowledgments section.",
  "write.02.title": "Create a Professional README for Your Open Source Project",
  "write.03.prompt": "Write detailed API documentation that developers will actually want to read. Include an overview of the API's purpose and capabilities, authentication and authorization requirements with examples, endpoint references with request/response schemas, interactive code examples in multiple programming languages, comprehensive error code documentation with troubleshooting tips, rate limiting details, and versioning policy.",
  "write.03.title": "Document Your API with Developer-Friendly Guides",
  "write.04.prompt": "Create a technical design document that clearly communicates the system architecture to both technical and non-technical stakeholders. Include problem statement and goals, high-level architecture overview with component diagrams, detailed data flow descriptions, technology choices with justification, scalability and performance considerations, security measures, testing strategy, and rollout plan with risk mitigation.",
  "write.04.title": "Write a Technical Design Document for Your System",
  "write.05.prompt": "Write a user-friendly guide that helps users accomplish their goals with your software. Include a getting started section with prerequisites, step-by-step instructions with clear screenshots descriptions, helpful tips and shortcuts, frequently asked questions, troubleshooting section for common issues, and links to additional resources for advanced users.",
  "write.05.title": "Create a User Guide That Actually Helps Users",
  "write.06.prompt": "Draft professional release notes that keep users informed and excited about updates. Include a summary of the release highlights, detailed descriptions of new features with usage examples, improvements and optimizations made, bugs fixed with issue references, breaking changes with clear migration instructions, deprecation notices, and acknowledgments for contributors.",
  "write.06.title": "Write Release Notes That Users Will Actually Read",
  "write.07.prompt": "Write a thorough post-mortem report that turns a production incident into a learning opportunity. Include an executive summary, detailed timeline of events, root cause analysis using techniques like 5 Whys, impact assessment with affected users and systems, response evaluation including what went well and what could improve, concrete action items with owners and deadlines, and lessons learned for the team.",
  "write.07.title": "Document an Incident Post-Mortem for Team Learning",
  "write.08.prompt": "Create a comprehensive onboarding guide that helps new developers become productive quickly. Include team introduction and communication channels, development environment setup instructions, codebase architecture overview with key directories, coding standards and conventions, common workflows like feature development and code review, debugging tips, list of helpful resources, and first week suggested tasks.",
  "write.08.title": "Build an Onboarding Guide for New Team Members",
  "write.09.prompt": "Write a technical RFC (Request for Comments) that proposes a significant system change and invites feedback. Include a clear problem statement with impact, proposed solution with detailed technical approach, alternative solutions considered with trade-offs, migration strategy for existing systems, success metrics and monitoring plan, timeline and resource requirements, and open questions for discussion.",
  "write.09.title": "Draft a Technical RFC to Propose System Changes",
  "write.10.prompt": "Write a compelling project proposal document that clearly articulates the problem being solved and its business impact, presents a well-thought-out solution with technical approach, includes realistic milestones and timeline, specifies resource requirements and budget considerations, defines measurable success metrics and KPIs, and addresses potential risks with mitigation strategies.",
  "write.10.title": "Draft a Project Proposal to Get Stakeholder Buy-in",
  "write.11.prompt": "Create a comprehensive testing strategy document that outlines the testing approach for a software project. Include testing objectives and scope, test levels (unit, integration, e2e, performance), test environment requirements, test data management strategy, automation approach with tool selections, quality gates and coverage targets, and roles and responsibilities.",
  "write.11.title": "Write a Testing Strategy for Quality Assurance",
  "write.12.prompt": "Write a clear and actionable runbook for operating a production system. Include system overview and architecture, common operational tasks with step-by-step instructions, monitoring and alerting guide, incident response procedures, troubleshooting decision trees, escalation paths, and maintenance procedures with scheduling recommendations.",
  "write.12.title": "Create an Operations Runbook for Your System",
  "write.13.prompt": "Draft a security assessment report that evaluates the security posture of an application. Include executive summary for leadership, methodology and scope, vulnerability findings categorized by severity, detailed technical descriptions with evidence, risk ratings and business impact, prioritized remediation recommendations, and compliance status against relevant standards.",
  "write.13.title": "Write a Security Assessment Report",
  "write.14.prompt": "Create a data migration plan that ensures safe and complete data transfer between systems. Include migration scope and objectives, data mapping and transformation rules, validation and verification procedures, rollback strategy and triggers, timeline with milestones, communication plan for stakeholders, and post-migration verification checklist.",
  "write.14.title": "Plan a Data Migration with Detailed Documentation",
  "write.15.prompt": "Write a performance optimization report that documents findings and recommendations. Include baseline performance metrics, load testing methodology and results, identified bottlenecks with root cause analysis, optimization recommendations prioritized by impact, implementation roadmap, expected improvements with success criteria, and monitoring plan.",
  "write.15.title": "Document Performance Optimization Findings",
  "write.16.prompt": "Create a disaster recovery plan that ensures business continuity. Include business impact analysis, recovery objectives (RTO/RPO), critical system inventory and dependencies, recovery procedures for different scenarios, communication protocols and contact lists, testing schedule and procedures, and plan maintenance and update process.",
  "write.16.title": "Write a Disaster Recovery Plan for Resilience",
  "write.17.prompt": "Write a code review guide that helps team members provide effective feedback. Include review objectives and principles, what to look for (correctness, performance, security, style), how to provide constructive feedback, common patterns and anti-patterns to watch for, review workflow and tools, and examples of good review comments.",
  "write.17.title": "Create a Code Review Guide for Your Team",
  "write.18.prompt": "Draft a technical interview guide for hiring engineers at a specific level. Include competencies to assess, example questions for each competency with follow-ups, evaluation rubrics with clear criteria, red flags and green flags to watch for, interview logistics and timing, and candidate experience considerations.",
  "write.18.title": "Design a Technical Interview Guide",
  "write.19.prompt": "Write a comprehensive changelog that helps users understand what changed between versions. Include version numbers with release dates, categorized changes (added, changed, deprecated, removed, fixed, security), clear descriptions with links to relevant docs or issues, migration notes for breaking changes, and acknowledgments for contributors.",
  "write.19.title": "Maintain a Helpful Changelog for Your Project",
  "write.20.prompt": "Create a software architecture decision record (ADR) that documents a significant technical decision. Include the context and problem statement, decision drivers and constraints, considered options with pros and cons, the chosen solution with rationale, consequences and trade-offs accepted, and related decisions or documents.",
  "write.20.title": "Document Architecture Decisions with ADRs",
  "write.21.prompt": "Write a comprehensive style guide for technical writing in your organization. Include voice and tone guidelines, formatting standards, terminology preferences and glossary, code example conventions, accessibility requirements, review process, and templates for common document types.",
  "write.21.title": "Create a Technical Writing Style Guide",
  "write.22.prompt": "Draft an engineering team charter that defines how the team operates. Include team mission and objectives, team composition and roles, decision-making processes, communication norms and meeting cadences, technical practices and standards, collaboration agreements, and success metrics and review process.",
  "write.22.title": "Write an Engineering Team Charter",
  "write.23.prompt": "Create a vendor evaluation document that helps make informed technology decisions. Include evaluation criteria with weightings, vendor comparison matrix, technical assessment findings, security and compliance review, total cost of ownership analysis, risk assessment, and final recommendation with rationale.",
  "write.23.title": "Evaluate Vendors with Structured Documentation",
  "write.24.prompt": "Write a product requirements document (PRD) that clearly defines what to build. Include problem statement and user needs, user personas and use cases, functional requirements with acceptance criteria, non-functional requirements (performance, security, etc.), UI/UX requirements with wireframes, success metrics, and timeline with dependencies.",
  "write.24.title": "Write Clear Product Requirements Documents",
  "write.25.prompt": "Create a system integration guide that helps teams connect with your system. Include integration overview and use cases, authentication and authorization setup, API endpoints with request/response examples, webhook configuration, error handling and retry strategies, testing and debugging tips, and support and escalation contacts.",
  "write.25.title": "Document System Integration for Partners",
  "write.26.prompt": "Write a capacity planning document that forecasts infrastructure needs. Include current system metrics and trends, growth projections with assumptions, capacity requirements analysis, scaling strategies and triggers, cost projections and optimization opportunities, implementation timeline, and review and update cadence.",
  "write.26.title": "Plan Infrastructure Capacity for Growth",
  "write.27.prompt": "Draft a compliance documentation package for regulatory requirements. Include compliance scope and applicable regulations, control mapping to requirements, evidence of compliance with documentation, gap analysis and remediation plan, audit preparation checklist, and ongoing compliance monitoring process.",
  "write.27.title": "Prepare Compliance Documentation for Audits",
  "write.28.prompt": "Create a feature specification document that guides implementation. Include feature overview and business value, user stories with acceptance criteria, technical requirements and constraints, data model changes, API changes with contracts, UI specifications, testing requirements, and rollout plan with feature flags.",
  "write.28.title": "Specify Features for Clear Implementation",
  "write.29.prompt": "Write a knowledge base article that helps users solve a specific problem. Include a clear problem statement, prerequisites and assumptions, step-by-step solution with screenshots, alternative approaches when applicable, troubleshooting tips for common issues, related articles and next steps, and feedback mechanism.",
  "write.29.title": "Write Knowledge Base Articles That Solve Problems",
  "write.30.prompt": "Create a sprint report that communicates progress to stakeholders. Include sprint goals and whether they were achieved, completed work with demos or screenshots, incomplete work with explanations, metrics and trends (velocity, quality, etc.), challenges encountered and how they were addressed, learnings and improvements, and next sprint preview.",
  "write.30.title": "Write Sprint Reports for Stakeholder Updates",
  "write.31.prompt": "Draft a technical debt inventory that tracks and prioritizes code quality issues. Include debt categories and definitions, inventory of current debt items with descriptions, impact assessment for each item, remediation effort estimates, prioritization framework and rankings, proposed remediation roadmap, and tracking and reporting process.",
  "write.31.title": "Document Technical Debt for Strategic Planning",
  "write.32.prompt": "Write an API versioning strategy document that guides long-term API evolution. Include versioning scheme and conventions, backward compatibility policy, deprecation process and timelines, migration support approach, version lifecycle stages, communication plan for changes, and client upgrade guidance.",
  "write.32.title": "Plan API Versioning Strategy for Long-term Success",
  "write.33.prompt": "Create a monitoring and alerting guide for a production system. Include key metrics to monitor, dashboard design and organization, alert definitions with thresholds, on-call response procedures, incident classification criteria, escalation paths, and regular review and tuning process.",
  "write.33.title": "Design Monitoring and Alerting for Production",
  "write.34.prompt": "Write a database schema documentation that helps developers understand data structures. Include entity-relationship diagrams, table descriptions with column details, relationship explanations, indexing strategy and rationale, common queries and their optimization, data lifecycle and archival policies, and change management process.",
  "write.34.title": "Document Database Schema for Developers",
  "write.35.prompt": "Draft a cost optimization report that identifies savings opportunities. Include current cost breakdown by service, cost trends and projections, optimization opportunities identified, implementation recommendations with estimated savings, risk assessment for each recommendation, prioritized action plan, and ongoing monitoring approach.",
  "write.35.title": "Write Cost Optimization Reports for Cloud Spending",
  "write.36.prompt": "Create an engineering career ladder document that defines growth paths. Include level definitions with expectations, competency frameworks for each level, example behaviors and impact at each level, promotion criteria and process, compensation philosophy, career path options (IC vs management), and FAQ for common questions.",
  "write.36.title": "Define Engineering Career Ladders for Growth",
  "write.37.prompt": "Write a data privacy impact assessment for a new feature or system. Include processing activity description, data inventory and flows, legal basis for processing, risk identification and assessment, privacy controls and mitigations, data subject rights implementation, and compliance verification checklist.",
  "write.37.title": "Assess Data Privacy Impact for New Features",
  "write.38.prompt": "Create a service level agreement (SLA) document for internal or external customers. Include service description and scope, availability and performance targets, measurement methodology, incident response commitments, exclusions and limitations, remediation and compensation terms, and review and amendment process.",
  "write.38.title": "Define Service Level Agreements for Reliability",
  "write.39.prompt": "Write a technology radar document that guides technology adoption decisions. Include radar format explanation, technology categorization (adopt, trial, assess, hold), rationale for each technology placement, adoption guidelines and considerations, review and update cadence, and contribution process for suggestions.",
  "write.39.title": "Create a Technology Radar for Strategic Decisions",
  "write.40.prompt": "Draft a lessons learned document from a completed project. Include project overview and objectives, what went well with specific examples, what could be improved with root causes, unexpected challenges and how they were handled, recommendations for future projects, quantified outcomes vs initial estimates, and team acknowledgments.",
  "write.40.title": "Document Lessons Learned for Continuous Improvement"
}
